.config/mamiza-emacs/emacs.org
#+TITLE: Mamiza's emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

* Startup Performance
** Lexical Binding
#+begin_src emacs-lisp

  ;; -*- lexical binding: t; -*-

#+end_src
** GCMH Mode
#+begin_src emacs-lisp

  ;; Install "gcmh" for better garbage collection system
  (use-package gcmh
    :config
    (add-to-list 'load-path "gcmh")
    (gcmh-mode 1))

#+end_src
** Display initialization time

This function will display the time it took to initialize emacs
at startup.

#+begin_src emacs-lisp

  (defun mamiza/display-startup-time ()
    (message "⏲️ Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'mamiza/display-startup-time)

#+end_src
* Package Management
** Package Manager
#+begin_src emacs-lisp

  (require 'package) ;; Load emacs' default package manager to start

  ;; Setup package repositories
  (setq package-archives '(("mepla" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Install "use-package" to configure other packages
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package) ;; Load "use-package"

  ;; Install packages on the first launch of emacs
  (setq use-package-always-ensure t)

  ;; Be verbose (for debugging)
  (setq use-package-verbose t)

#+end_src
** Auto-Update
#+begin_src emacs-lisp

;; Install "auto-package-update" to update packages automatically
(use-package auto-package-update
  :custom
  (auto-package-update-interval 1)
  (auto-package-update-prompt-before update t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "24:00"))

#+end_src
* Basic UI Improvements
** GUI Elements
#+begin_src emacs-lisp

  (setq inhibit-startup-message t) ;; Don't display splash screen

  (set-fringe-mode 5) ;; Add a little bit of padding on the side

  (tool-bar-mode -1) ;; Don't display the toolbar
  (menu-bar-mode -1) ;; Don't display the menu bar
  (tooltip-mode -1)  ;; Don't display tooltips
  (scroll-bar-mode -1) ;; Don't display scroll bar
  (setq use-dialog-box nil) ;; Don't show any pop-up gui elements

  (global-display-line-numbers-mode t) ;; Display line numbers
  (column-number-mode) ;; Display column number

  ;; Don't display line numbers in some modes
  (dolist (mode '(term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Font Configuration
#+begin_src emacs-lisp

  ;; Set the font properly both in normal emacs and the daemon
  (defun mamiza/set-font-faces ()
    (set-face-attribute 'default nil :font "Iosevka" :height 180)
    (set-face-attribute 'fixed-pitch nil :font "Iosevka" :height 180)
    (set-face-attribute 'variable-pitch nil :font "Monospace" :height 180 :weight 'regular))

  (if (daemonp)
      (add-hook 'after-make-frame-functions
                (lambda (frame)
                  (setq doom-modeline-icon t)
                  (with-selected-frame frame
                    (mamiza/set-font-faces))))
    (mamiza/set-font-faces))

#+end_src

** Theming
*** Icons
#+begin_src emacs-lisp

  ;; Install "all-the-icons"
  (use-package all-the-icons)

#+end_src
*** Modeline
#+begin_src emacs-lisp

  ;; Install "doom-modeline"
  (use-package doom-modeline
    :init
    (doom-modeline-mode 1)
    :custom
    (doom-modeline-height 5))

#+end_src
*** Color Schemes
#+begin_src emacs-lisp

  ;; Install "doom-themes"
  (use-package doom-themes)

  ;; Install "gruber-darker-theme" from tsoding
  (use-package gruber-darker-theme)

  ;; Load the selected theme here
  (load-theme 'doom-dracula t)

#+end_src
* Keybindings
** Change Text Size
#+begin_src emacs-lisp

;; Resize texts easier
(global-set-key (kbd "C-=") 'text-scale-increase)
(global-set-key (kbd "C--") 'text-scale-decrease)

#+end_src
** Which-Key
#+begin_src emacs-lisp

  ;; Install "which-key" to display hints for keybinding
  (use-package which-key
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 1))

#+end_src
** Evil
*** NOT-Evil
#+begin_src emacs-lisp

  ;; Define a hook to disable evil in some modes
  (defun mamiza/not-evil-hook ()
    (dolist (mode '(custom-mode
                    eshell-mode
                    git-rebase-mode
                    erc-mode
                    circe-server-mode
                    circe-chat-mode
                    circe-query-mode
                    sauron-mode
                    term-mode))
      (add-to-list 'evil-emacs-state-modes mode)))

#+end_src
*** Evil
#+begin_src emacs-lisp

  ;; Install "evil" and adding some keybindings
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :hook
    (evil-mode . mamiza/not-evil-hook)
    :demand t
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

    ;; Use viusal line motions even outside of "visual-line-mode" buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    ;; Set some initial state for some modes
    (evil-set-initial-state 'message-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

#+end_src

#+begin_src emacs-lisp

  ;; Install "evil-collection" for mode spicific evil keybindings
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

#+end_src
*** Evil Commenter
#+begin_src emacs-lisp

  ;; Install "evil-nerd-commenter" to comment lines
  (use-package evil-nerd-commenter
    :bind ("C-/" . evilnc-comment-or-uncomment-lines))

#+end_src
** General
#+begin_src emacs-lisp

    ;; Install "general" for better keybindings
    (use-package general
      :after evil
      :config
      (general-create-definer mamiza/leader-keys
        :states '(normal visual)
        :keymaps 'override
        :prefix "SPC"
        :global-prefix "C-SPC")

      ;; TODO: Seperate all the keybindings into their respective sections
      (mamiza/leader-keys
        "SPC" '(counsel-find-file :which-key "Find file")

        "w" '(:ignore t :which "Window")
        "w=" '(balance-windows :which-key "Balance")
        "wc" '(evil-window-delete :which-key "Close")
        "wv" '(evil-window-vsplit :which-key "Vertical split")
        "ws" '(evil-window-split :which-key "Horizontal split")
        "wo" '(delete-other-windows :which-key "Kill other")
        "ww" '(evil-window-next :which-key "Next")
        "wW" '(evil-window-prev :which-key "Previous")
        "wm" '(maximize-window :which-key "Maximize")

        "b" '(:ignore t :which-key "Buffer actions")
        "bk" '(kill-current-buffer :which-key "Kill buffer")
        "bb" '(counsel-switch-buffer :which-key "Switch buffer")

        "t" '(:ignore t :which-key "Toggle")
        "tt" '(counsel-load-theme :which-key "Themes")
        "tw" '(whitespace-mode toggle :which-key "Whitespaces")

        "c" '(:ignore t :which-key "Configure")
        "cf" '(:ignore t :which-key "File")
        "cfe" '((lambda () (interactive) (find-file (expand-file-name "~/.config/emacs/emacs.org"))) :which-key "Emacs")

        "z" '(ispell-word :which-key "Spell Check")))

#+end_src
* Documentation
** Helpful
#+begin_src emacs-lisp

;; Install "helpful" for better documentation
(use-package helpful
  :commands (helpful-callable helpful-variable helpful-command helpful-key)
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))

#+end_src
* Text Editing
** Remember Cursor Position
#+begin_src emacs-lisp

  ;; Store last cursor position in the cache directory
  (setq save-place-file "~/.cache/emacs/places")
  ;; Actually enable the feature
  (save-place-mode 1)

#+end_src
** Multiple Cursors
#+begin_src emacs-lisp

  (use-package evil-mc
    :after evil
    :config
    (global-evil-mc-mode 1))

#+end_src
