.config/mamiza-emacs/emacs.org
** Auto-Revert Files & Buffers
#+begin_src emacs-lisp

  ;; Refresh file buffers if change from outside emacs
  (global-auto-revert-mode 1)
  ;; Refresh other kinds of buffers too
  (setq global-auto-revert-non-file-buffers t)

#+end_src
** Colorful Delimiters
#+begin_src emacs-lisp

  ;; Install "rainbow-delimiters" to colorize delimiters
  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode))

#+end_src
** Clear Useless Whitespaces
#+begin_src emacs-lisp

    (use-package ws-butler
      :init
      (add-hook 'org-mode-hook #'ws-butler-mode)
      (add-hook 'prog-mode-hook #'ws-butler-mode)
      (add-hook 'text-mode-hook #'ws-butler-mode))

#+end_src
** Whitespace Mode
#+begin_src emacs-lisp

  ;; Only display "space-mark" when "whitespace-mode" is active
  (setq whitespace-display-mappings '((space-mark 32 [183] [46])))

#+end_src
** Use Spaces Instead of Tabs for Indentation
#+begin_src emacs-lisp

  (setq-default indent-tabs-mode nil)

#+end_src
** Close My Parenthesis
#+begin_src emacs-lisp

  (electric-pair-mode 1)

#+end_src
** CSV Mode
#+begin_src emacs-lisp

(use-package csv-mode)

#+end_src
** Spell Check
#+begin_src emacs-lisp

  (use-package flyspell-mode
    :ensure nil
    :init
    (add-hook 'text-mode-hook 'flyspell-mode)
    (add-hook 'prog-mode-hook 'flyspell-prog-mode)

    (setq ispell-program-name "hunspell")
    (setq ispell-hunspell-dict-paths-alist '(("en_US" "/usr/share/hunspell/en_US.aff")))
    (setq ispell-local-dictionary "en_US")
    (setq ispell-local-dictionary-alist '(("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)))
    :commands ispell-word
    :config
    (flyspell-mode 1))

#+end_src
** Rainbow Mode
#+begin_src emacs-lisp

    (use-package rainbow-mode
      :commands rainbow-mode)

  (mamiza/leader-keys
    "tr" '(rainbow-mode :which-key "Rainbow Mode"))

#+end_src
* Completion System
** Ivy
#+begin_src emacs-lisp

  ;; Install "ivy" as my completion system
  (use-package ivy
    :diminish
    :bind
    (("C-f" . swiper)
    :map ivy-minibuffer-map
    ("TAB" . ivy-alt-done)
    ("C-l" . ivy-alt-done)
    ("C-j" . ivy-next-line)
    ("C-k" . ivy-previous-line)
    :map ivy-switch-buffer-map
    ("C-k" . ivy-previous-line)
    ("C-l" . ivy-done)
    ("C-d" . ivy-switch-buffer-kill)
    :map ivy-reverse-i-search-map
    ("C-k" . ivy-pervious-line)
    ("C-d" . ivy-reverse-i-search-kill))
    :config
    (setq  ivy-re-builders-alist '((t . orderless-ivy-re-builder)))
    (add-to-list 'ivy-highlight-functions-alist '(orderless-ivy-re-builder . orderless-ivy-highlight))
    (ivy-mode 1))

#+end_src
** Ivy-Rich
#+begin_src emacs-lisp

  ;; Install "ivy-rich" for a more friendly interface for "ivy"
  (use-package ivy-rich
    :after ivy
    :config
    (ivy-rich-mode 1))

#+end_src
** Counsel
#+begin_src emacs-lisp

  ;; Install "counsel" for various completion functions from "ivy"
  (use-package counsel
    :bind (("M-x" . counsel-M-x)
    ("C-x C-f" . counsel-find-file))
    :config
    ;; Don't input default things in ivy prompts
    (setq ivy-initial-inputs-alist nil)
    (counsel-mode 1))

#+end_src
** Ivy-Prescient
#+begin_src emacs-lisp

  ;; Install "ivy-prescient" as a filtering system that uses prescient as a backend
  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))

#+end_src
** Company
*** Company
#+begin_src emacs-lisp

  ;; Install "company" for code completion
  (use-package company
    :after lsp-mode
    :hook
    (lsp-mode . company-mode)
    :bind
    (:map company-active-map
          ("<tab>" . company-complete-selection))
    (:map lsp-mode-map
          ("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-lenght 1)
    (company-idle-delay 0.0))

#+end_src
*** Company-Box
#+begin_src emacs-lisp

    ;; Install "company-box" a company frontend with icons 
    (use-package company-box
      :hook (company-mode . company-box-mode))

#+end_src
** Orderless
#+begin_src emacs-lisp

  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion--category-override '((file (styles basic partial-completion)))))

#+end_src
* Development
** Magit
#+begin_src emacs-lisp

  ;; Install "magit" , the best package EVER
  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (mamiza/leader-keys
    "gg" '(:ignore t :which-key "Magit")
    "gc" '(magit-clone :which-key "Clone")
    "gg" '(magit-status :which-key "Status"))

#+end_src
** LSP
*** LSP
#+begin_src emacs-lisp

;; Install "lsp-mode" for language server support
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

#+end_src
*** LSP-UI
#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook
    (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom))

#+end_src
** Syntax
#+begin_src emacs-lisp

(use-package flycheck)

#+end_src
** Languages
*** Shell
**** LSP For Sh-Mode
#+begin_src emacs-lisp

    (use-package sh-mode
      :ensure nil
      :hook
      (sh-mode . lsp-deferred))

#+end_src
**** Shellcheck
#+begin_src emacs-lisp

  (use-package flymake-shellcheck
    :commands flymake-shellchek-load
    :init
    (add-hook 'sh-mode-hook 'flymake-shellcheck-load))

#+end_src
*** Python
**** LSP for Python
#+begin_src emacs-lisp

  ;; Install "python-mode" for python lsp support
  (use-package python-mode
    :hook
    (python-mode . lsp-deferred)
    :custom
    ;; Spicify which python binary to use in python mode
    ;; You can comment this seciton out if you have python binary as python3
    (python-shell-interpreter "python3")
    :bind
    (("C-<backspace>" . backward-kill-word)))

#+end_src
*** C/C++
**** LSP For C/C++
#+begin_src emacs-lisp

  (add-hook 'c-mode-hook 'lsp)
  (add-hook 'c++-mode-hook 'lsp)

#+end_src
*** Emacs-Lisp
**** ELisp Syntax Checking
#+begin_src emacs-lisp

            (use-package emacs-lisp-mode
              :ensure nil
              :hook
              (emacs-lisp-mode . flycheck-mode))
            ;; Enable company mode when editing elisp files
            (add-hook 'emacs-lisp-mode-hook 'company-mode)

#+end_src>
**** Bindings
#+begin_src emacs-lisp

            (mamiza/leader-keys
              "e" '(:ignore t :which-key "Evaluate")
              "eb" '(eval-buffer :which-key "Buffer")
              "er" '(eval-region :which-key "Region"))

#+end_src
*** Yaml
#+begin_src emacs-lisp

    (use-package yaml-mode
      :mode "\\.yml\\'")

#+end_src
*** Vimscript
#+begin_src emacs-lisp

  (use-package vimrc-mode
    :defer t
    :config
    (add-to-list 'auto-mode-alist '("\\.vim\\(rc\\)?\\'" . vimrc-mode)))

#+end_src
** Compilation
*** Compile
#+begin_src emacs-lisp

  (use-package compile
    :ensure nil
    :commands compile
    :config
    (setq compilation-scroll-output t))

#+end_src
*** Compile Command
#+begin_src emacs-lisp

(setq compile-command nil)

#+end_src
*** Bindings
#+begin_src emacs-lisp

  (mamiza/leader-keys "C" '(compile :which-key "Compile"))

#+end_src
** Snippets
#+begin_src emacs-lisp

      ;; Install "yasnippet" for snippet "backend"
      (use-package yasnippet
        :hook (prog-mode . yas-minor-mode))

      ;; Install "yasnippet-snippets" for useful snippets
      (use-package yasnippet-snippets
        :after yasnippet)

#+end_src
** Terminal
*** Emacs' Built-In Terminal
#+begin_src emacs-lisp

    (use-package term
      :ensure nil
      :config
      (setq explicit-shell-file-name "/usr/bin/zsh")
      (setq term-prompt-regexp "^\[.*@.*\]\$ "))


    (use-package eterm-256color
      :after term
      :hook (term-mode . eterm-256color-mode))

#+end_src
*** VTerm
#+begin_src emacs-lisp

    (use-package vterm
      :commands vterm
      :config
      (setq vterm-shell "zsh")
      (setq vterm-max-scrollback 16384))

#+end_src
*** Eshell
#+begin_src emacs-lisp

  (defun mamiza/configure-eshell ()
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    (add-to-list 'eshell-output-filter-function 'eshell-truncate-buffer)

    (evil-normalize-keymaps)

    (setq eshell-history-size nil
          eshell-buffer-maximum-lines 16384
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell
    :ensure nil
    :hook
    (eshell-first-time-mode . mamiza/configure-eshell))

#+end_src
* Dired
** Setup Dired
#+begin_src emacs-lisp

    ;; Configure "dired"
    (use-package dired
      :ensure nil
      :commands (dired dired-jump)
      :config
      (evil-collection-define-key 'normal 'dired-mode-map
        "h" 'dired-up-directory
        "l" 'dired-open-file
        "c" 'dired-unmark-all-marks
        (kbd "<left>") 'dired-up-directory
        (kbd "<right>") 'dired-open-file)
      :custom
      ((dired-listing-switches "-aho --group-directories-first")))

#+end_src
