.config/mamiza-emacs/emacs.org
** Setup Icons For Dired
#+begin_src emacs-lisp

  ;; Install "all-the-icons-dired"
  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))

#+end_src
** Open Certain Files With External Programs
#+begin_src emacs-lisp

  ;; Install "dired-open" for opening files with dired
  (use-package dired-open
    :commands (dired dired-jump)
    :config
    (setq dired-open-extensions '(("png" . "sxiv -b")
                                  ("mkv" . "mpv"))))
#+end_src
** Colorful Dired Chmod String
#+begin_src emacs-lisp

  (use-package diredfl
    :init (diredfl-global-mode 1))

#+end_src

** Bindings
#+begin_src emacs-lisp

  (mamiza/leader-keys
    "d" '(:ignore t :which-key "Dired")
    "dd" '(dired-jump :which-key "Here")
    "do" '(counsel-dired :which-key "Open ?"))

#+end_src
* Clean-up Emacs
#+begin_src emacs-lisp

  ;; Don't a different file for custom variables
  (setq custom-file (concat user-emacs-directory "custom.el"))
  (when (file-exists-p custom-file)
    (load custom-file))

  ;; Store autosave and backup files in the cache directory
  (let ((backup-dir "~/.cache/emacs/backup/")
        (autosave-dir "~/.cache/emacs/autosave/"))
    (dolist (dir (list backup-dir autosave-dir))
      (when (not (file-directory-p dir))
        (make-directory dir t)))
    (setq backup-directory-alist `(("." . ,backup-dir))
          auto-save-file-name-transforms `((".*" ,autosave-dir t))
          auto-save-list-file-prefix (concat autosave-dir ".save-")
          tramp-backup-directory-alist `((".*" . ,backup-dir))
          tramp-auto-save-directory autosave-dir))

  ;; Take some precaution
  (setq backup-by-copying t
        delete-old-versions t
        version-control t
        kept-new-versions 5
        kept-old-versions 2)

  ;; Don't create lock files
  (setq create-lockfiles nil) 

#+end_src
* Org Mode
** Org Mode Setup
#+begin_src emacs-lisp

  (defun mamiza/org-mode-setup ()
    (org-indent-mode)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-indent nil))

#+end_src
** Org
#+begin_src emacs-lisp

  ;; Install "org"
  (use-package org
    :mode (("\\.org$" . org-mode))
    :init
    (when (not (file-directory-p "~/.local/share/emacs/"))
      (make-directory "~/.local/share/emacs/"))
    (when (not (file-exists-p "~/.local/share/emacs/agenda.org"))
      (with-temp-buffer (write-file "~/.local/share/emacs/agenda.org")))
    :hook
    (org-mode . mamiza/org-mode-setup)
    :config
    (setq org-ellipsis " >"
          org-hide-emphasis-markers t
          org-agenda-files '("~/.local/share/emacs/agenda.org")))

#+end_src
** Completion
#+begin_src emacs-lisp

  ;; Enable company mode when editing org files
  (add-hook 'org-mode-hook 'company-mode)

#+end_src
** Org-Bullets
#+begin_src emacs-lisp

  ;; Install "org-bullets" for better headers
  (use-package org-bullets
    :after org
    :hook
    (org-mode . org-bullets-mode))

#+end_src
** Org-Tempo
#+begin_src emacs-lisp

  ;; Load "org-tempo" for org templates
  (require 'org-tempo)

#+end_src

*** Templates
#+begin_src emacs-lisp

  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

#+end_src

** Org-Babel
#+begin_src emacs-lisp

        ;; Load syntax highlighting for certain languages to use in source blocks
        (with-eval-after-load 'org
          (org-babel-do-load-languages
           'org-babel-load-languages
           '((emacs-lisp . t))))

        ;; Don't ask confirmation for evaluating
        (setq org-confirm-babel-evaluate nil)

#+end_src
** Auto-tangle Configuration Files
#+begin_src emacs-lisp
  
  ;; Tangle this file on save
  (defun mamiza/auto-org-babel-tangle ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/.config/emacs/emacs.org"))
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'mamiza/auto-org-babel-tangle)))

#+end_src

** Bindings
#+begin_src emacs-lisp

  (mamiza/leader-keys
    "o" '(:ignore t :which-key "Org")
    "ot" '(org-babel-tangle :which-key "Tangle"))

#+end_src
